misc/scala-install.org
# -*- coding: utf-8 -*-
#+TITLE: sbt など scala 関連ソフトウェアのインストール
#+AUTHOR: Takehide Soh
#+EMAIL: soh@lion.kobe-u.ac.jp
#+OPTIONS: ^:nil H:2 num:t
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup

#+HTML_HEAD: <!-- Global site tag (gtag.js) - Google Analytics -->
#+HTML_HEAD: <script async src="https://www.googletagmanager.com/gtag/js?id=UA-6313627-5"></script>
#+HTML_HEAD: <script>
#+HTML_HEAD:   window.dataLayer = window.dataLayer || [];
#+HTML_HEAD:  function gtag(){dataLayer.push(arguments);}
#+HTML_HEAD:  gtag('js', new Date());
#+HTML_HEAD:  gtag('config', 'UA-6313627-5');
#+HTML_HEAD: </script>

#+HTML_HEAD: <script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
#+HTML_HEAD: <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script>
#+HTML_HEAD: <script src="https://unpkg.com/sticky-table-headers"></script>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./css/readtheorg.css"/>
#+HTML_HEAD: <script type="text/javascript" src="https://tsoh.org/scarab/js/readtheorg.js"></script>

#+HTML_HEAD: <style type="text/css">
#+HTML_HEAD: <!--/*--><![CDATA[/*><!--*/
#+HTML_HEAD: #content { max-width: 1200px; }
#+HTML_HEAD:  /*]]>*/-->
#+HTML_HEAD: </style>

* 基本方針
  - sbt のインストール方法については, [[https://www.scala-sbt.org/1.x/docs/ja/Setup.html][本家のサイト]] に詳しい解説が記載
    されているので，これを参照するのが一番確実．
  - 以下では, 上記のサイトを参考にして, Windows10, Ubuntu 18.04, Mac OS 10.11.6 で成功した方法を記載する. 

* Windows における sbt 他のインストール方法
  - Windows で Scala プログラミングするために以下が必要になる．
    - Java SDK (8以降)
    - sbt
  - Windows でこれらのソフトウェアを直接インストールするとパスの
    設定などが，面倒なことがある．
  - Windows のパッケージ管理システムである chocolatey を使うと, パスを
    自動的に追加してくれるので便利である.
  - 以下では, chocolatey を使ったこれらのインストール方法を説明する．
    - Windows10 で Powershell を使う方法を想定している．

** chocolatey のインストール
https://chocolatey.org/install へアクセスし指示に従う．
2019年3月時点で，以下の方法でインストールできることを確認している
(Windows 10)．
   - Powershell (*管理者として実行*) を開き, 以下のコマンドを実行する．
     #+BEGIN_SRC sh
     Set-ExecutionPolicy Bypass -Scope Process -Force; iex ((New-Object System.Net.WebClient).DownloadString('https://chocolatey.org/install.ps1'))
     #+END_SRC
   - Powershell を閉じる
   - (確認) Powershell を開き, 以下のコマンドを実行し, バージョンが表
     示されれば成功. 
     #+BEGIN_SRC sh
     > choco
     #+END_SRC

** Java 8 SDK と sbt のインストール (chocolatey を使用)
   - Powershell (*管理者として実行*) を開き, 以下のコマンドを実行する．
     #+BEGIN_SRC sh
     > choco install jdk8
     #+END_SRC
   - Powershell を閉じる
   - Powershell (*管理者として実行*) を開き, 以下のコマンドを実行する．
     #+BEGIN_SRC sh
     > choco install sbt
     #+END_SRC
   - Powershell を閉じる

** IntelliJ IDEA のインストール (chocolatey を使用)
sbt があれば, scala プログラミングは可能．追加で IntelliJ IDEA を
インストールする場合は以下の方法で行う．
   - Powershell (*管理者として実行*) を開き, 以下のコマンドを実行する．
     #+BEGIN_SRC sh
     > choco install intellijidea-community
     #+END_SRC
   - Powershell を閉じる

** scala のインストール (chocolatey を使用)
sbt があれば, scala プログラミングは可能．追加で scala を
インストールする場合は以下の方法で行う．
   - Powershell (*管理者として実行*) を開き, 以下のコマンドを実行する．
     #+BEGIN_SRC sh
     > choco install scala
     #+END_SRC
   - Powershell を閉じる
   - ただし, 2019年3月時点で, chocolatey でインストールできる scala は,
     最新版ではなくバージョン 2.11.8 になる. 

* Mac における sbt 他のインストール方法
** sbt のインストール
  - Macports を使ってインストールするのが便利.
    #+BEGIN_SRC sh
    $ sudo port install sbt
    #+END_SRC
  - Homebrew も使えます. 詳しくは[[https://www.scala-sbt.org/1.x/docs/ja/Installing-sbt-on-Mac.html][本家サイト]]を参照．
  - Java がないとエラーが出れば以下を行った後に, もう一度上記を実行す
    る. 

** JDK 8 のインストール
   - [[http://www.oracle.com/technetwork/java/javase/downloads/jdk8-downloads-2133151.html][Oracle]] のページからインストールする. 
 
* Ubuntu Linux (他 Debian系) における sbt 他のインストール方法
** sbt のインストール
   - apt や apt-get を使ってインストールするのが便利.
   - apt-get を使った方法を以下に示す ([[https://www.scala-sbt.org/1.x/docs/ja/Installing-sbt-on-Linux.html][参考]]).
     #+BEGIN_SRC sh
     $ echo "deb https://dl.bintray.com/sbt/debian /" | sudo tee -a /etc/apt/sources.list.d/sbt.list
     $ sudo apt-key adv --keyserver hkp://keyserver.ubuntu.com:80 --recv 2EE0EA64E40A89B84B2DF73499E82A75642AC823
     $ sudo apt-get update
     $ sudo apt-get install sbt
     #+END_SRC
   - Java がないとエラーが出れば以下を行った後に, もう一度上記を実行す
     る. 

** JDK 8 のインストール 
   - apt や apt-get を使ってインストールするのが便利. 以下は openjdk
     をインストールしている. 
     #+BEGIN_SRC sh
     $ sudo apt-get install openjdk-8-jdk
     #+END_SRC


* COMMENT memo
- chocolatey https://chocolatey.org/packages?q=scala
- ドワンゴのマニュアル
  - https://dwango.github.io/scala_text/sbt-install.html

