misc/scala-install.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-03-08 金 16:38 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>sbt など scala 関連ソフトウェアのインストール</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Takehide Soh" />
<!-- Global site tag (gtag.js) - Google Analytics -->
<link rel="stylesheet" type="text/css" href="https://tsoh.org/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://tsoh.org/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">sbt など scala 関連ソフトウェアのインストール</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 基本方針</a></li>
<li><a href="#orgheadline6">2. Windows における sbt 他のインストール方法</a>
<ul>
<li><a href="#orgheadline2">2.1. chocolatey のインストール</a></li>
<li><a href="#orgheadline3">2.2. Java 8 SDK と sbt のインストール (chocolatey を使用)</a></li>
<li><a href="#orgheadline4">2.3. IntelliJ IDEA のインストール (chocolatey を使用)</a></li>
<li><a href="#orgheadline5">2.4. scala のインストール (chocolatey を使用)</a></li>
</ul>
</li>
<li><a href="#orgheadline9">3. Mac における sbt 他のインストール方法</a>
<ul>
<li><a href="#orgheadline7">3.1. sbt のインストール</a></li>
<li><a href="#orgheadline8">3.2. JDK 8 のインストール</a></li>
</ul>
</li>
<li><a href="#orgheadline12">4. Ubuntu Linux (他 Debian系) における sbt 他のインストール方法</a>
<ul>
<li><a href="#orgheadline10">4.1. sbt のインストール</a></li>
<li><a href="#orgheadline11">4.2. JDK 8 のインストール</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 基本方針</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>sbt のインストール方法については, <a href="https://www.scala-sbt.org/1.x/docs/ja/Setup.html">本家のサイト</a> に詳しい解説が記載
されているので，これを参照するのが一番確実．
<ul class="org-ul">
<li>ただし，Windows に関しては本家サイトの方法だと環境変数の設定が
必要になるので, パッケージ管理ソフト chocolatey を使う以下の方法
がおすすめ．</li>
</ul></li>
<li>以下では, 上記のサイトを参考にして, Windows10, Ubuntu 18.04, Mac OS 10.11.6 で成功した方法を記載する.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">2</span> Windows における sbt 他のインストール方法</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Windows で Scala プログラミングするために以下が必要になる．
<ul class="org-ul">
<li>Java SDK (8以降)</li>
<li>sbt</li>
</ul></li>
<li>Windows でこれらのソフトウェアを直接インストールするとパスの
設定などが，面倒なことがある．</li>
<li>Windows のパッケージ管理システムである chocolatey を使うと, パスを
自動的に追加してくれるので便利である.</li>
<li>以下では, chocolatey を使ったこれらのインストール方法を説明する．
<ul class="org-ul">
<li>Windows10 で Powershell を使う方法を想定している．</li>
</ul></li>
</ul>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">2.1</span> chocolatey のインストール</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="https://chocolatey.org/install">https://chocolatey.org/install</a> へアクセスし指示に従う．
2019年3月時点で，以下の方法でインストールできることを確認している
(Windows 10)．
</p>
<ul class="org-ul">
<li><p>
Powershell (<b>管理者として実行</b>) を開き, 以下のコマンドを実行する．
</p>
<div class="org-src-container">

<pre class="src src-sh">Set-ExecutionPolicy Bypass -Scope Process -Force; iex ((New-Object System.Net.WebClient).DownloadString(<span style="color: #8b2252;">'https://chocolatey.org/install.ps1'</span>))
</pre>
</div></li>
<li>Powershell を閉じる</li>
<li><p>
(確認) Powershell を開き, 以下のコマンドを実行し, バージョンが表
示されれば成功. 
</p>
<div class="org-src-container">

<pre class="src src-sh">&gt; choco
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">2.2</span> Java 8 SDK と sbt のインストール (chocolatey を使用)</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><p>
Powershell (<b>管理者として実行</b>) を開き, 以下のコマンドを実行する．
</p>
<div class="org-src-container">

<pre class="src src-sh">&gt; choco install jdk8
</pre>
</div></li>
<li>Powershell を閉じる</li>
<li><p>
Powershell (<b>管理者として実行</b>) を開き, 以下のコマンドを実行する．
</p>
<div class="org-src-container">

<pre class="src src-sh">&gt; choco install sbt
</pre>
</div></li>
<li>Powershell を閉じる</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.3</span> IntelliJ IDEA のインストール (chocolatey を使用)</h3>
<div class="outline-text-3" id="text-2-3">
<p>
sbt があれば, scala プログラミングは可能．追加で IntelliJ IDEA を
インストールする場合は以下の方法で行う．
</p>
<ul class="org-ul">
<li><p>
Powershell (<b>管理者として実行</b>) を開き, 以下のコマンドを実行する．
</p>
<div class="org-src-container">

<pre class="src src-sh">&gt; choco install intellijidea-community
</pre>
</div></li>
<li>Powershell を閉じる</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">2.4</span> scala のインストール (chocolatey を使用)</h3>
<div class="outline-text-3" id="text-2-4">
<p>
sbt があれば, scala プログラミングは可能．追加で scala を
インストールする場合は以下の方法で行う．
</p>
<ul class="org-ul">
<li><p>
Powershell (<b>管理者として実行</b>) を開き, 以下のコマンドを実行する．
</p>
<div class="org-src-container">

<pre class="src src-sh">&gt; choco install scala
</pre>
</div></li>
<li>Powershell を閉じる</li>
<li>ただし, 2019年3月時点で, chocolatey でインストールできる scala は,
最新版ではなくバージョン 2.11.8 になる.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">3</span> Mac における sbt 他のインストール方法</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">3.1</span> sbt のインストール</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><p>
Macports を使ってインストールするのが便利.
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo port install sbt
</pre>
</div></li>
<li>Homebrew も使えます. 詳しくは<a href="https://www.scala-sbt.org/1.x/docs/ja/Installing-sbt-on-Mac.html">本家サイト</a>を参照．</li>
<li>Java がないとエラーが出れば以下を行った後に, もう一度上記を実行す
る.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">3.2</span> JDK 8 のインストール</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><a href="http://www.oracle.com/technetwork/java/javase/downloads/jdk8-downloads-2133151.html">Oracle</a> のページからインストールする.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12"><span class="section-number-2">4</span> Ubuntu Linux (他 Debian系) における sbt 他のインストール方法</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">4.1</span> sbt のインストール</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>apt や apt-get を使ってインストールするのが便利.</li>
<li><p>
apt-get を使った方法を以下に示す (<a href="https://www.scala-sbt.org/1.x/docs/ja/Installing-sbt-on-Linux.html">参考</a>).
</p>
<div class="org-src-container">

<pre class="src src-sh">$ echo <span style="color: #8b2252;">"deb https://dl.bintray.com/sbt/debian /"</span> | sudo tee -a /etc/apt/sources.list.d/sbt.list
$ sudo apt-key adv --keyserver hkp://keyserver.ubuntu.com:80 --recv 2EE0EA64E40A89B84B2DF73499E82A75642AC823
$ sudo apt-get update
$ sudo apt-get install sbt
</pre>
</div></li>
<li>Java がないとエラーが出れば以下を行った後に, もう一度上記を実行す
る.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">4.2</span> JDK 8 のインストール</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li><p>
apt や apt-get を使ってインストールするのが便利. 以下は openjdk
をインストールしている. 
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo apt-get install openjdk-8-jdk
</pre>
</div></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Takehide Soh</p>
<p class="date">Created: 2019-03-08 金 16:38</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
